Repository: ecg-media/mml.administration-app
Catalog: lib/l10n/admin_app_*.arb
Languages: de, ru

# appTitle
source: My Media Lib Administration
de: Meine Mediathek Administration
ru: Администрация Моя Медиатека

# serverName
source: Servername (domain:port)
de: Server (Domain:Port)
ru: Сервер (домен:порт)

# serverNameUnchanged
source: Servername (domain:port) (unchanged)
de: Server (Domain:Port) (unverändert)
ru: Сервер (домен:порт) (прежний)

# invalidServerName
source: A valid server name must be specified!
de: Eine korrekte Serveradresse muss angegeben werden!
ru: Адрес сервера неправильный!

source: Login
de: Anmelden
ru: Войти

source: Username
de: Benutzername
ru: Логин

source: Password
de: Passwort
ru: Пароль

source: Password (unchanged)
de: Passwort (unverändert)
ru: Пароль (прежний)

source: Client-ID
ru: Идентификатор клиента

source: Client-ID (unchanged)
de: Client-ID (unverändert)
ru: Идентификатор клиента (прежний)

source: App-Key
de: App-Schlüssel
ru: Ключ приложения

source: App-Key (unchanged)
de: App-Schlüssel (unverändert)
ru: Ключ приложения (прежний)

# invalidClientId
source: A valid Client-ID must be specified!
de: Eine korrekte Client-ID muss angegeben werden!
ru: Идентификатор клиента неправильный!

# invalidAppKey
source: An valid App-Key must be specified!
de: Ein korrekter App-Schlüssel muss angegeben werden!
ru: Ключ приложения неправильный!

# invalidUsername
source: Please enter your username!
de: Bitte geben Sie Ihren Benutzernamen an!
ru: Пожалуйста введите логин!

# invalidPassword
source: Please enter your password!
de: Bitte geben Sie Ihr Passwort an!
ru: Пожалуйста введите пароль!

# badCertificate
source: An certificate error occurred!
de: Es ist ein Zertifikatfehler aufgetreten!
ru: Произошла ошибка с сертификатом!

# unexpectedError
source: An unexpected error occurred: {message}
de: Es ist ein unerwarterter Fehler aufgetreten: {message}
ru: Произошла непредвиденная ошибка: {message}

# forbidden
source: You have not the necessary rights, to execute this action!
de: Sie haben nicht die notwendigen Rechte, die Aktion auszuführen!
ru: У вас нет необходимых прав, чтобы выполнить это действие!

# incorrectCredentials
source: Login failed!
de: Anmeldung fehlgeschlagen!
ru: Не удалось войти в систему!

source: Records
de: Aufnahmen
ru: Записи

# adminUsers
source: Admins
ru: Админы

source: Devices
de: Geräte
ru: Устройства

source: Settings
de: Einstellungen
ru: Настройки

source: Logout
de: Abmelden
ru: Выйти

# relogin
source: You were automatically logged out! Please login again!
de: Sie wurden automatisch abgemeldet! Bitte melden Sie sich neu an!
ru: Срок действия вашего логина истёк! Пожалуйста, войдите в систему ещё раз!

source: Advanced
de: Erweitert
ru: Дополнительные настройки

source: Add
de: Hinzufügen
ru: Добавить

source: Remove
de: Löschen
ru: Удалить

source: Cancel
de: Abbrechen
ru: Отменить

source: Filter
ru: Фильтр

# save
source: Apply
de: Anwenden
ru: Применить

# confirmAccount
source: Please update your password to proceed.
de: Bitte aktualisieren Sie Ihr Passwort, um fortzufahren.
ru: Пожалуйста, обновите свой пароль, чтобы продолжить.

source: Actual password
de: Aktuelles Passwort
ru: Текущий пароль

source: New Password
de: Neues Passwort
ru: Новый пароль

# confirmNewPassword
source: Confirm password
de: Passwort bestätigen
ru: Подтвердить пароль

# invalidConfirmPasswords
source: New password does not match verification.
de: Neues Passwort stimmt mit Überprüfung nicht überein.
ru: Новый пароль не соответствует проверке.

# updatePasswordFailed
source: Updating password failed!
de: Passwortaktualisierung fehlgeschlagen!
ru: Не удалось обновить пароль!

source: Actual user
de: Aktueller Benutzer
ru: Текущий пользователь

source: Change Password
de: Passwort ändern
ru: Сменить пароль

# noData
source: No records were found!
de: Keine Datensätze wurden gefunden!
ru: Никаких записей найдено не было!

source: Reload
de: Neu laden
ru: Перезагрузить

# editClient
source: Edit device
de: Gerät bearbeiten
ru: Переименовать устройства

source: Register client
de: Gerät registrieren
ru: Зарегистрировать устройство

# displayName
source: Name
ru: Имя

# invalidDisplayName
source: Please enter a name!
de: Bitte geben Sie einen Namen an!
ru: Пожалуйста введите имя!

# deleteConfirmation
source: Are you really want to delete the selected records?
de: Möchten Sie tatsächlich die gewählten Datensätze löschen?
ru: Вы действительно хотите удалить выбранные записи?

source: Yes
de: Ja
ru: Да

# createUser
source: Create admin
de: Admin hinzufügen
ru: Добавить администратора

# editUser
source: Edit admin
de: Admin bearbeiten
ru: Изменить администратора

# notFound
source: The requested record wasn't found!
de: Der aufgerufene Datensatz wurde nicht gefunden!
ru: Запрошенная запись не найдена!

# retrieveTokenFailed
source: A token could not be retrieved!
de: Es konnte kein Token geladen werden!
ru: Не удалось загрузить токен!

# invalidDeviceName
source: Please enter a device name!
de: Bitte geben Sie eine Gerätebezeichnung an!
ru: Пожалуйста, введите название устройства!

source: Device name
de: Gerätebezeichnung
ru: Название устройства

# lastTokenRefresh
source: Last activity: {date}
de: Letzte Aktivität: {date}
ru: Последняя активность: {date}

source: Groups
de: Gruppen
ru: Группы

source: Create group
de: Gruppe erstellen
ru: Добавить группу

source: Edit group
de: Gruppe bearbeiten
ru: Изменить группу

source: Group name
de: Gruppenname
ru: Название группы

# groupIsDefault
source: Default group
de: Standardgruppe
ru: Стандартная группа

# groupIsDefaultHint
source: Group will be assigned per default on client creation.
de: Gruppe wird beim Erstellen neuer Geräte automatisch zugewiesen.
ru: Группа будет назначена по умолчанию при создании клиента.

# invalidGroupName
source: Please enter a name!
de: Bitte geben Sie einen Namen an!
ru: Пожалуйста, введите название группы!

# invalidGroupIsDefault
source: Please specify, whether the group is a default group or not!
de: Bitte legen Sie fest, ob die Gruppe eine Standardgruppe ist!
ru: Пожалуйста, укажите, является ли группа стандартной или нет!

# uploading
source: Uploading files.
de: Dateien werden hochgeladen.
ru: Загрузка файлов.

source: Unknown
de: Unbekannt
ru: Неизвестный

source: Date
de: Datum
ru: Дата

source: Artist
de: Interpret
ru: Исполнитель

source: Genre
ru: Жанр

source: Album
ru: Альбом

# toLargeFile
source: File {fileName} is to large.
de: Datei {fileName} ist zu groß.
ru: Файл {fileName} слишком большой.

# uploadingFileFailed
source: An error occurred while uploading the file {fileName}: {error}
de: Beim Hochladen der Datei {fileName} ist ein Fehler aufgetreten: {error}
ru: Произошла ошибка при загрузке файла {fileName}: {error}

# invalidMp3File
source: File is not a valid MP3 file.
de: Datei ist keine gültige MP3-Datei.
ru: Файл не является допустимым файлом MP3.

# invalidFileNoContent
source: File has no content.
de: Datei hat keinen Inhalt.
ru: В файле нет содержимого.

source: Upload folder
de: Ordner hochladen
ru: Загрузить папку

source: Upload files
de: Dateien hochladen
ru: Загрузить файлы

source: Actual connection settings
de: Aktuelle Verbindungseinstellungen
ru: Текущие настройки подключения

source: Edit record
de: Aufnahme bearbeiten
ru: Изменить запись

source: Title
de: Titel
ru: Название

# invalidTitle
source: A title must be specified.
de: Ein Titel muss angegeben werden.
ru: Необходимо указать название.

source: Upload finished.
de: Upload abgeschlossen.
ru: Загрузка завершена

# notUploadedFiles
source: Following files were not uploaded.
de: Folgende Dateien wurden nicht hochgeladen.
ru: Следующие файлы не были загружены.

source: Upload settings
de: Upload Einstellungen
ru: Параметры загрузки

# compressionRate
source: Bitrate in kbit/s
ru: Битрейт в кбит/с

# compressionInfo
source: Compression occurs at the next upload. With an empty bitrate, there is no compression.
de: Kompression erfolgt beim nächsten Upload. Bei leerer Bitrate erfolgt keine Kompression.
ru: Сжатие происходит при следующей загрузке. При пустом битрейте сжатие не происходит.

# invalidCompressionRate
source: The value must be greater than zero.
de: Der Wert muss größer als Null sein.
ru: Значение должно быть больше нуля.

source: Version
ru: Версия

source: back
de: zurück
ru: назад

source: Folder
de: Ordner
ru: Папка

# selectGroups
source: Select the groups for the records
de: Wählen Sie die Gruppen für die Aufnahmen aus
ru: Выберите группы для записи

source: Language
de: Sprache
ru: Язык

# defaults
source: Default
de: Standard
ru: По умолчанию

source: Edit bitrates
de: Bitraten verwalten
ru: Редактировать битрейты

source: Info
ru: Инфо

source: Livestreams
ru: Трансляции

source: Edit live stream
de: Livestream bearbeiten
ru: Редактировать трансляцию

source: Create live stream
de: Livestream erstellen
ru: Добавить трансляцию

# streamUrl
source: Url to live stream
de: Url zum Livestream
ru: Ссылка на трансляцию

# streamUrlHint
source: Internal url to streaming endpoint: http://<address>:<port>
de: Interne Url zum Streamingendpunkt: http://<adresse>:<port>
ru: Внутренний url-адрес конечной точки трансляции: http://<адрес>:<порт>

# similarClients
source: Similar Devices
ru: Похожее устройство

# onlyNew
source: New
de: Neu
ru: Новые

# uploadValidation
source: MP3-Tag Validation
de: MP3-Tag Validierung
ru: Проверка MP3-тегов

# uploadValidLanguage
source: Language is set
de: Sprache ist gesetzt
ru: Язык указан

# uploadValidTitle
source: Title is set
de: Titel ist gesetzt
ru: Название указана

# uploadValidNumber
source: Tracknumber is set
de: Tracknummer ist gesetzt
ru: Номер трека указан

# uploadValidCover
source: Cover is set
de: Cover ist gesetzt
ru: Обложка указана

# uploadValidArtist
source: Artist is set
de: Interpret ist gesetzt
ru: Исполнитель указан

# uploadValidAlbum
source: Album is set
de: Album ist gesetzt
ru: Альбом указан

# uploadValidGenre
source: Genre is set
de: Genre ist gesetzt
ru: Жанр указан

# uploadValidAlbums
source: Valid albums
de: Gültige Alben
ru: Допустимые альбомы

# uploadValidAlbumInfo
source: Album names separated by a comma. If empty, then no limitation of albums.
de: Albennamen getrennt mit einem Komma. Wenn leer, dann keine Eingrenzung der Alben.
ru: Названия альбомов, разделенные запятой. Если пусто, то альбомы не ограничиваются.

# uploadValidGenres
source: Valid genres
de: Gültige Genres
ru: Допустимые жанры

# uploadValidGenreInfo
source: Genre names separated with a comma. If empty, then no limitation of genres.
de: Genrenamen getrennt mit einem Komma. Wenn leer, dann keine Eingrenzung der Genres.
ru: Названия жанров, разделенные запятой. Если пусто, то жанры не ограничиваются.

# uploadValidFilename
source: File name template
ru: Формат названия файла

# uploadValidFilenameInfo
source: File name must meet special format. Regex. Standard no restriction.
de: Dateiname muss spezielles Format erfüllen. Regex. Standard keine Begrenzung.
ru: Название файла должно соответствовать специальному формату. Regex. По умолчанию без ограничений.

# uploadInvalidLanguage
source: Language is not set or unknown.
de: Sprache ist nicht gesetzt oder unbekannt.
ru: Язык не указан или неизвестен.

# uploadInvalidAlbum
source: Album is not set.
de: Album ist nicht gesetzt.
ru: Альбом не указан.

# uploadInvalidAlbums
source: Album is invalid.
de: Album ist ungültig.
ru: Альбом является недопустимым.

# uploadInvalidGenre
source: Genre is not set.
de: Genre ist nicht gesetzt.
ru: Жанр не указан.

# uploadInvalidGenres
source: Genre is invalid.
de: Genre ist ungültig.
ru: Жанр является недопустимым.

# uploadInvalidArtist
source: Artist is not set.
de: Interpret ist nicht gesetzt.
ru: Исполнитель не указан.

# uploadInvalidTitle
source: Title is not set.
de: Titel ist nicht gesetzt.
ru: Название не указано.

# uploadInvalidNumber
source: Track number is not set.
de: Tracknummer ist nicht gesetzt.
ru: Номер трека не указан.

# uploadInvalidCover
source: Cover is not available.
de: Cover ist nicht verfügbar.
ru: Обложка отсутствует.

# uploadInvalidFilenameFormat
source: File name does not match expected format.
de: Dateiname entspricht nicht erwartetes Format.
ru: Имя файла не соответствует ожидаемому формату.

# uploadValidFailed
source: An unexpected error occurred while uploading.
de: Beim Hochladen ist ein unerwarterter Fehler aufgetreten.
ru: При загрузке произошла непредвиденная ошибка.

source: Do not validate
ru: Не проверять

source: Validate
de: Überprüfen
ru: Проверить

source: Required
de: Pflichtfeld
ru: Обязательное

# assignTo
source: Assign
de: Zuordnen
ru: Назначить

# selectLoaded
source: Select all loaded elements
de: Alle geladenen Elemente auswählen
ru: Выбрать все загруженные элементы

# makeUndeletable
source: Not deletable
ru: Неудаляемый

source: Lock
ru: Заблокировать

source: New Update
ru: Новое обновление

source: Later
ru: Позже

# checkUpdate
source: Check new features and improvements.
ru: Посмотрите новые функции и улучшения.

# updateInstall
source: Update and install
ru: Обновить и установить

source: Downloading...
ru: Скачивание...

# newVersion
source: A new Version {latestVersion} is available.
ru: Доступна новая версия {latestVersion}.

# oldVersion
source: You are currently running version {appVersion}.
ru: В данный момент используется версия {appVersion}.

source: Bitrates
de: Bitraten
